[
  {
    "theme": "Сквозной производственный процесс (СПП)",
    "question": "Какой эффект от внедрения сквозного производственного процесса должны увидеть Заказчики ИТ блока?",
    "answersTrue": [
      "Повышение дисциплины реализации проектов",
      "Повышение качества автоматизированных систем"
    ],
    "answersFalse": [
      "Упрощение процедуры по исключению необязательных шагов СПП с целью сокращения стоимости проектов",
      "Запрет на развитие систем, не переданных для тестирования в ДК"
    ]
  },
  {
    "theme": "Сквозной производственный процесс (СПП)",
    "question": "Какой эффект от внедрения сквозного производственного процесса должны увидеть сотрудники ИТ блока?",
    "answersTrue": [
      "Чёткое разделение ответственности между ролями",
      "Выявление ответственных в нецелевых подразделениях",
      "Упорядочивание производственного процесса"
    ],
    "answersFalse": [
      "Рост числа конфликтов при передаче результатов с этапа на этап"
    ]
  },
  {
    "theme": "Сквозной производственный процесс (СПП)",
    "question": "Для чего внедрение сквозного производственного процесса разбито на четыре волны?",
    "answersTrue": [
      "Сбор обратной связи и совершенствование процесса",
      "Выравнивание нагрузки на команду внедрения и методологов"
    ],
    "answersFalse": [
      "Выстраивание очереди в зависимости от влияния на ППР заказчиков",
      "Раздувание бюджета и сроков проекта"
    ]
  },
  {
    "theme": "Сквозной производственный процесс (СПП)",
    "question": "Какие результаты для Банка и заказчиков ожидаются от внедрения СПП в текущей волне?",
    "answersTrue": [
      "Предотвращение неожиданных задержек внедрения вследствие реализации непроработанных требований или несогласованной архитектуры",
      "Недопущение вывода в промышленную эксплуатацию некачественного ПО",
      "Предотвращение неожиданного увеличения затрат вследствие реализации непроработанных требований или несогласованной архитектуры"
    ],
    "answersFalse": [
      "Повышение в должности Заказчика проекта"
    ]
  },
  {
    "theme": "Сквозной производственный процесс (СПП)",
    "question": "Представьте, что Вы – Аналитик АС и не уверены с кем нужно согласовывать документ СТАС. Что нужно сделать, чтобы найти ответ на ваш вопрос?",
    "answersTrue": [
      "Обратиться к линейному руководителю, тех.руку или МУР по вашей системе",
      "Зарегистрировать запрос на сайте - горячей линии поддержки через своего руководителя, тех.рука или МУР по вашей системе"
    ],
    "answersFalse": [
      "Позвонить руководителю проекта «Внедрение сквозного производственного процесса в ИТ»",
      "Позвонить генеральному директору СБТ и рассказать, что вы думаете об всей этой бюрократии и писанине"
    ]
  },
  {
    "theme": "Сквозной производственный процесс (СПП)",
    "question": "Как может повлиять внедрение сквозного производственного процесса на бюджет открытых проектов?",
    "answersTrue": [
      "Будет предотвращено неожиданное увеличение затрат вследствие реализации непроработанных и не согласованных требований",
      "Будет предотвращено неожиданное увеличение затрат вследствие реализации ошибочной и несогласованной архитектуры",
      "Будут устранены ошибки в текущих бюджетах проектов"
    ],
    "answersFalse": [
      "Запланировано увеличение затрат, т.к. СПП требует подготовки множества документов, которые раньше не требовались"
    ]
  },
  {
    "theme": "Сквозной производственный процесс (СПП)",
    "question": "На каком этапе ЖЦ ИТ-составляющей проекта готовят БТ?",
    "answersTrue": [
      "На этапе \"Анализ\" ЖЦ ИТ-составляющей проекта"
    ],
    "answersFalse": [
      "На этапе \"Подготовка к открытию\" ЖЦ ИТ-составляющей проекта",
      "На этапе \"Функциональное проектирование и реализация требований\" ЖЦ ИТ-составляющей проекта",
      "БТ могут готовиться на любом этапе ЖЦ ИТ-составляющей проекта"
    ]
  },
  {
    "theme": "Сквозной производственный процесс (СПП)",
    "question": "Какие варианты контроля наличия ресурсов предусмотрены в контрольной точке перед подготовкой проекта к открытию (КоТ «Одобрена проработка решения»)?",
    "answersTrue": [
      "Проверяется КРП"
    ],
    "answersFalse": [
      "Проверяется выделение ресурсов в АСУП Ариадна",
      "Обзваниваются все заинтересованные лица",
      "Не контролируется. Тех. рук. должен сам найти необходимые ресурсы в рамках предпроекта"
    ]
  },
  {
    "theme": "Сквозной производственный процесс (СПП)",
    "question": "Что контролирует менеджер по тестированию при согласовании решения проекта в КоТ «Решение согласовано»?",
    "answersTrue": [
      "Достаточность ДБТ для планирования работ по сквозному (End-to-End) тестированию проектного решения"
    ],
    "answersFalse": [
      "Соответствие СТАС программе и методике испытаний",
      "Работоспособность программного продукта",
      "Наличие стенда интеграционного тестирования"
    ]
  },
  {
    "theme": "Сквозной производственный процесс (СПП)",
    "question": "В какой момент можно запрашивать прогнозный номер релиза (ПНР) для доработок в рамках проекта?",
    "answersTrue": [
      "Сперва нужно согласовать комплект ДБТ+КА+ТК, затем необходимо получить детальные оценки, и только потом можно запрашивать ПНР"
    ],
    "answersFalse": [
      "Сразу после открытия проекта на ООУ",
      "Сразу после согласования комплекта ДБТ, КА и ТК со всеми релизными командами, вовлечённым в реализацию проекта.",
      "Сразу после подготовки комплекта ДБТ, КА и ТК"
    ]
  },
  {
    "theme": "Сквозной производственный процесс (СПП)",
    "question": "Что сдаётся в рамках приёмки результатов ИТ-составляющей проекта?",
    "answersTrue": [
      "Целостное ИТ решение, сочетающее доработки ряда АС и существующую функциональность систем"
    ],
    "answersFalse": [
      "Дистрибутивы АС, включённых в проект",
      "Проектная команда, которой не удалось добиться результата",
      "Новая функциональность, установленная в промышленную эксплуатацию"
    ]
  },
  {
    "theme": "Сквозной производственный процесс (СПП)",
    "question": "Сколько раз может быть пройдена контрольная точка «Функциональное проектирование завершено» в ЖЦ ИТ-составляющей проекта?",
    "answersTrue": [
      "Произвольное количество раз"
    ],
    "answersFalse": [
      "Один или два раза",
      "Только один раз",
      "Это контрольная точка в релизе отдельной АС."
    ]
  },
  {
    "theme": "Сквозной производственный процесс (СПП)",
    "question": "Сколько раз должна быть пройдена контрольная точка «Сквозное тестирование решения завершено» в ЖЦ ИТ-составляющей проекта?",
    "answersTrue": [
      "Только один раз"
    ],
    "answersFalse": [
      "Один или два раза",
      "Произвольное количество раз",
      "Это контрольная точка в релизе отдельной АС."
    ]
  },
  {
    "theme": "Сквозной производственный процесс (СПП)",
    "question": "Какие действия могут быть предприняты, если при согласовании СТАС выявлены новые требования, отсутствовавшие в ДБТ?",
    "answersTrue": [
      "Оценить влияние изменений на трудозатраты, стоимость и сроки проекта. Внести изменения в ДБТ и утвердить изменившиеся параметры проекта на ООУ",
      "Исключить из СТАС требования не соответствующие ДБТ и реализовать их в рамках отдельного проекта",
      "Оценить влияние изменений на трудозатраты, стоимость и сроки проекта. Внести изменения в ДБТ, исключив неприоритетные требования и тем самым сохранив утверждённые параметры проекта"
    ],
    "answersFalse": [
      "Ничего предпринимать не требуется. Разработчики обязаны исполнять обязательства, данные при открытии проекта."
    ]
  },
  {
    "theme": "Сквозной производственный процесс (СПП)",
    "question": "Какие ключевые активности выполняются проектной командой на этапе «Реализация требований»?",
    "answersTrue": [
      "Отслеживание исполнения работ по проекту, реализация корректирующих действий при отклонениях",
      "Подготовка к тестированию"
    ],
    "answersFalse": [
      "Разработка детальных бизнес-требований",
      "Во время этого этапа за всё отвечают релизные команды отдельных АС, поэтому проектная команда может сходить в отпуск"
    ]
  },
  {
    "theme": "Сквозной производственный процесс (СПП)",
    "question": "На какой период должно быть сформировано расписание релизов?",
    "answersTrue": [
      "На 10-15 месяцев вне зависимости от числа зарегистрированных ЗНИ АС"
    ],
    "answersFalse": [
      "На срок, необходимый для реализации зарегистрированных ЗНИ АС",
      "На ближайший квартал",
      "Расписание релизов не фиксируется заранее и определяется планами проектов"
    ]
  },
  {
    "theme": "Сквозной производственный процесс (СПП)",
    "question": "На каких основаниях МВР АС может отказаться согласовать СТАС?",
    "answersTrue": [
      "СТАС противоречит требованиям по сопровождению АС"
    ],
    "answersFalse": [
      "Детализация СТАС недостаточна для планирования приёмо-сдаточных испытаний релиза АС",
      "МВР АС, обладая многолетним опытом сопровождения, может указать на ошибки в спроектированном Бизнес процессе",
      "МВР АС не уполномочен согласовывать СТАС"
    ]
  },
  {
    "theme": "Сквозной производственный процесс (СПП)",
    "question": "На каких основаниях Тест-менеджер может отказаться согласовать СТАС?",
    "answersTrue": [
      "Детализация СТАС недостаточна для тестирования АС"
    ],
    "answersFalse": [
      "Тест-менеджер, обладая критическим мышлением, может указать на ошибки в спроектированном Бизнес процессе",
      "СТАС противоречит требованиям смежных проектов",
      "Тест-менеджер не уполномочен согласовывать СТАС"
    ]
  },
  {
    "theme": "Сквозной производственный процесс (СПП)",
    "question": "Что делается в рамках технического проектирования релиза АС?",
    "answersTrue": [
      "Выбор технического решения для реализации совокупности СТАС в релизе",
      "Оценка влияния запрошенных доработок на архитектуру системы"
    ],
    "answersFalse": [
      "Установка дистрибутива на стенд СТ",
      "Разработка пользовательского интерфейса системы"
    ]
  },
  {
    "theme": "Сквозной производственный процесс (СПП)",
    "question": "В какой момент Дистрибутивный комплект должен быть передан для установки на стенд Системного тестирования?",
    "answersTrue": [
      "В соответствии с расписанием релиза, обычно за несколько дней до окончания этапа «Разработка релиза»",
      "После завершения отладки и успешного выполнения всех модульных тестов"
    ],
    "answersFalse": [
      "В плановую дату КоТ «Разработка релиза завершена»",
      "Установка дистрибутива не требуется, так как Системное тестирование проводится на стенде разработки"
    ]
  },
  {
    "theme": "Сквозной производственный процесс (СПП)",
    "question": "В какой контрольной точке проверяется передача Дистрибутивного комплекта в ФПД?",
    "answersTrue": [
      "КоТ «ИФТ релиза завершено»"
    ],
    "answersFalse": [
      "КоТ «Разработка релиза завершена»",
      "КоТ «СТ релиза завершено»",
      "КоТ «Подготовка к ПСИ релиза завершена»"
    ]
  },
  {
    "theme": "Сквозной производственный процесс (СПП)",
    "question": "В какой контрольной точке проверяется установка Дистрибутивного комплекта на стенд ИФТ?",
    "answersTrue": [
      "КоТ «СТ релиза завершено»"
    ],
    "answersFalse": [
      "КоТ «Разработка релиза завершена»",
      "КоТ «ИФТ релиза завершено»",
      "КоТ «Подготовка к ПСИ релиза завершена»"
    ]
  },
  {
    "theme": "Сквозной производственный процесс (СПП)",
    "question": "Какие результаты контролируются в КоТ «Подготовка к ПСИ релиза завершена»?",
    "answersTrue": [
      "Среда ПСИ",
      "ПМИ"
    ],
    "answersFalse": [
      "Дистрибутивный комплект",
      "Проект распоряжения о внедрении релиза АС"
    ]
  },
  {
    "theme": "Сквозной производственный процесс (СПП)",
    "question": "Чем отличается тест-менеджер от менеджера по тестированию?",
    "answersTrue": [
      "Первый отвечает за тестирование в релизе, второй - за тестирование в проекте"
    ],
    "answersFalse": [
      "Это четыре совершенно разных человека",
      "Первый отвечает за тестирование в проекте, второй - за тестирование в релизе",
      "Ничем - это разные названия одной роли"
    ]
  },
  {
    "theme": "Сквозной производственный процесс (СПП)",
    "question": "Какая роль отвечает за своевременную реализацию ИТ-составляющей в проектах?",
    "answersTrue": [
      "Технический руководитель"
    ],
    "answersFalse": [
      "Руководитель проекта",
      "Руководитель разработки",
      "Менеджер по управлению релизами"
    ]
  },
  {
    "theme": "Сквозной производственный процесс (СПП)",
    "question": "Что должен сделать МУР на этапе «Разработка релиза» в случае, если Дистрибутив не предоставлен к промежуточной дате, зафиксированной расписанием релиза, а до КоТ «Разработка завершена» остаётся 5 рабочих дней?",
    "answersTrue": [
      "Необходимо провести встречу с руководителем разработки и тест-менеджером для поиска решений, позволяющих вернуть релиз в план",
      "Если не удастся найти решение в Релизной команде, необходимо привлечь к поиску решения начальников отделов в ЦК и ДК"
    ],
    "answersFalse": [
      "Ничего предпринимать не требуется, т.к. дата КоТ ещё не наступила",
      "Необходимо провести встречу с руководителем разработки для поиска решений, возвращающих релиз в план. Тест-менеджера привлекать не нужно"
    ]
  },
  {
    "theme": "Сквозной производственный процесс (СПП)",
    "question": "Что должен сделать Тех.Рук. на этапе «Проектирование и реализация решения» в проекте, если СТАС не согласован к запланированной дате, а до КоТ «Фиксация состава релиза» остаётся 5 рабочих дней?",
    "answersTrue": [
      "Необходимо провести встречу с руководителем разработки и тест-менеджером для поиска решений, позволяющих вернуть релиз в план",
      "Если не удастся найти решение в Релизной команде, необходимо привлечь к поиску решения начальников отделов в ЦК и ДК"
    ],
    "answersFalse": [
      "Ничего предпринимать не требуется, т.к. дата КоТ ещё не наступила",
      "Необходимо провести встречу с руководителем разработки для поиска решений, возвращающих релиз в план. Тест-менеджера привлекать не нужно"
    ]
  },
  {
    "theme": "Сквозной производственный процесс (СПП)",
    "question": "Кто и в какой момент должен проинформировать бизнес партнёра о риске задержки прохождения КоТ в проекте?",
    "answersTrue": [
      "Тех.рук. должен уведомить бизнес-партнёра в случае, если не удаётся найти решение на уровне начальников отделов"
    ],
    "answersFalse": [
      "Тех.рук. должен уведомить бизнес-партнёра сразу после выявления риска",
      "Тех.рук. должен уведомить бизнес-партнёра после выработки плана корректирующих мероприятий и внесения изменений в план проекта",
      "Начальник отдела УПМ должен уведомить бизнес-партнёра в случае, если не удаётся найти решение на уровне начальников отделов"
    ]
  },
  {
    "theme": "Сквозной производственный процесс (СПП)",
    "question": "Кто и в какой момент должен проинформировать бизнес партнёра о риске задержки прохождения КоТ в релизе?",
    "answersTrue": [
      "Начальник отдела МУР должен уведомить бизнес-партнёра в случае, если не удаётся найти решение на уровне начальников отделов"
    ],
    "answersFalse": [
      "МУР должен уведомить бизнес-партнёра после выработки плана корректирующих мероприятий и внесения изменений в план релиза",
      "Тех.рук. должен уведомить бизнес-партнёра после выработки плана корректирующих мероприятий и внесения изменений в план проекта",
      "Начальник отдела УПМ должен уведомить бизнес-партнёра в случае, если не удаётся найти решение на уровне начальников отделов"
    ]
  },
  {
    "theme": "Сквозной производственный процесс (СПП)",
    "question": "Как расшифровывается роль МВР?",
    "answersTrue": [
      "Менеджер внедрения релизов АС"
    ],
    "answersFalse": [
      "Менеджер по вовлеченности разработчиков АС",
      "Менеджер по выпуску релизов АС",
      "Михаил Васильевич Романов"
    ]
  },
  {
    "theme": "Сквозной производственный процесс (СПП)",
    "question": "Как расшифровывается аббревиатура РР в СПП?",
    "answersTrue": [
      "Расписание релизов",
      "Руководитель разработчиков"
    ],
    "answersFalse": [
      "Резервирование ресурсов",
      "Российский Рубль"
    ]
  },
  {
    "theme": "Сквозной производственный процесс (СПП)",
    "question": "Сколько проектов может ставить требования к одному релизу отдельной АС?",
    "answersTrue": [
      "В рамках каждого релиза могут реализовываться доработки для произвольного числа проектов"
    ],
    "answersFalse": [
      "В каждом релизе должны выполняться доработки не более чем одного проекта",
      "В одном релизе разрешается совмещать доработки не более чем 6 проектов или НПЗ",
      "Перечень доработок в рамках релиза может определяться по запросам пользователей без привязки к проектам или НПЗ"
    ]
  },
  {
    "theme": "Сквозной производственный процесс (СПП)",
    "question": "Сколько СТАС готовится в проекте согласно ЖЦ проекта?",
    "answersTrue": [
      "Для каждого релиза каждой АС. Возможно разбиение на отдельные СТАС для отдельных ЗНИ АС"
    ],
    "answersFalse": [
      "СТАС является необязательным документом и как правило не готовится",
      "В проекте готовится ровно один документ СТАС",
      "В зависимости от физической подготовки Стас может готовиться от полумесяца до года"
    ]
  },
  {
    "theme": "Сквозной производственный процесс (СПП)",
    "question": "Какие действия относятся к этапу «Подготовка к открытию»?",
    "answersTrue": [
      "Разработка ИТ архитектуры проекта в целом, оценка затрат и сроков реализации, резервирование ресурсов для обоснования бюджета и сроков работ в ИТ-составляющей проекта"
    ],
    "answersFalse": [
      "Разработка и согласование СТАС",
      "Получение от Заказчика обоснования бюджета и сроков работ",
      "Подготовка экспресс-оценки и включение инициативы в портфель Банка"
    ]
  },
  {
    "theme": "Сквозной производственный процесс (СПП)",
    "question": "Когда готовится документ Детальные бизнес требования?",
    "answersTrue": [
      "До открытия проекта (как правило в рамках предпроекта)"
    ],
    "answersFalse": [
      "До подготовки экспресс-оценки и включения инициативы в портфель Банка",
      "После включения в портфель Банка, до открытия предпроекта",
      "После открытия проекта в срок до фиксации релиза соответствующей АС"
    ]
  },
  {
    "theme": "Сквозной производственный процесс (СПП)",
    "question": "Сколько релизов АС может реализовываться в рамках одного проекта?",
    "answersTrue": [
      "В рамках проекта может реализовываться произвольное число релизов произвольного числа АС"
    ],
    "answersFalse": [
      "В рамках проекта может быть по одному релизу произвольного числа АС",
      "Проекты могут дорабатывать системы нужные проектам сроки без привязки к релизам",
      "В каждом проекте должен быть ровно один релиз ровно одной автоматизированной системы"
    ]
  },
  {
    "theme": "Сквозной производственный процесс (СПП)",
    "question": "Как называется документ, который определяет критерии приёмки проектного решения Заказчиком?",
    "answersTrue": [
      "Программа и методика испытаний"
    ],
    "answersFalse": [
      "Критерии приёмки АС",
      "ТС №3626 \"Тестирование ПО\"",
      "Тест-план"
    ]
  },
  {
    "theme": "Сквозной производственный процесс (СПП)",
    "question": "Какое количество документов ДБТ предполагается в проекте согласно ЖЦ проекта?",
    "answersTrue": [
      "В проекте готовится один документ ДБТ"
    ],
    "answersFalse": [
      "Количество документов ДБТ соответствует количеству АС, изменяемых в проекте",
      "ДБТ является необязательным документом и как правило не готовится",
      "Суть ДБТ в том, что каждое элементарное требование должно быть оформлено отдельным документом объёмом не менее 50 страниц"
    ]
  },
  {
    "theme": "Сквозной производственный процесс (СПП)",
    "question": "Что обозначает аббревиатура ТК в производственном процессе?",
    "answersTrue": [
      "Технологическая карта"
    ],
    "answersFalse": [
      "Тестовый комплект",
      "Трудовой кодекс РФ",
      "Технический комплекс"
    ]
  },
  {
    "theme": "Сквозной производственный процесс (СПП)",
    "question": "Какая роль отвечает за организацию своевременного прохождения КоТ релизов и соблюдение расписания релизов отдельной АС?",
    "answersTrue": [
      "Менеджер по управлению релизами"
    ],
    "answersFalse": [
      "Руководитель разработки",
      "Руководитель проекта",
      "Технический руководитель"
    ]
  },
  {
    "author": "Щекалёв Дмитрий Константинович (ОНТИБиУР) 27/06/2016",
    "theme": "ВНД 2297",
    "question": "Каковы критерии успешного прохождения теста надежности согласно ВНД 2297 для любой АС?",
    "answersTrue": [
      "Отсутствие утечки системных ресурсов и отсутствие деградации производительности АС в ходе теста"
    ],
    "answersFalse": [
      "Только отсутствие деградации производительности АС в ходе теста",
      "Соблюдение SLA по производительности АС",
      "Соблюдение SLA по производительности АС и SLA по времени отклика АС"
    ]
  },
  {
    "author": "Щекалёв Дмитрий Константинович (ОНТИБиУР) 27/06/2016",
    "theme": "ВНД 2297",
    "question": "Термин отказоустойчивость согласно ВНД 2297 это?",
    "answersTrue": [
      "Возможность системы сохранять работоспособность в случае отказа/сбоя одной или нескольких смежных систем"
    ],
    "answersFalse": [
      "Возможность безотказной работы системы в длительном периоде эксплуатации",
      "Успешное исполнение всех операций в АС в случае отказа/сбоя одной или нескольких смежных систем",
      "Возможность системы сохранять работоспособность при повышенных эксплуатационных нагрузках"
    ]
  },
  {
    "author": "Щекалёв Дмитрий Константинович (ОНТИБиУР) 27/06/2016",
    "theme": "ВНД 2297",
    "question": "Результатом определения максимальной производительности согласно ВНД 2297 является?",
    "answersTrue": [
      "Максимальный достигнутый уровень нагрузки"
    ],
    "answersFalse": [
      "Определённые времена отклика системы",
      "Максимальный достигнутый уровень нагрузки и определенные времена отклика системы",
      "Определенная утилизация системных ресурсов, определенные времена отклика системы и максимальный достигнутый уровень нагрузки"
    ]
  },
  {
    "author": "Щекалёв Дмитрий Константинович (ОНТИБиУР) 27/06/2016",
    "theme": "ВНД 2297",
    "question": "Максимальная производительность согласно ВНД 2297 это?",
    "answersTrue": [
      "Наивысшая интенсивность выполнения операций обслуживаемых системой с соблюдением требуемого качества обслуживания"
    ],
    "answersFalse": [
      "Интенсивность выполнения операций обслуживаемых системой при которой возникла деградация производительности системы",
      "Интенсивность выполнения операций обслуживаемых системой при которой время отклика системы минимально",
      "Интенсивность выполнения операций обслуживаемых системой при которой время отклика системы максимально"
    ]
  },
  {
    "author": "Тимофеев Николай Петрович (ОНТИБиУР) 28/06/2016",
    "theme": "Общие вопросы по НТ",
    "question": "Что такое время отклика транзакции (transaction response time)? Это время…",
    "answersTrue": [
      "включающее в себя пересылку, обработку и сериализацию запроса суммарно на серверной части и клиентской стороне"
    ],
    "answersFalse": [
      "полученное в результате исполнения команды ping к хосту",
      "требуемое для обработки пользовательского запроса на сервере",
      "требуемое для пересылки запроса на сервер",
      "необходимое для формирования запроса на клиентской стороне"
    ]
  },
  {
    "author": "Тимофеев Николай Петрович (ОНТИБиУР) 28/06/2016",
    "theme": "Общие вопросы по НТ",
    "question": "Для чего необходима корреляция, в контексте записи/правки траффика нагрузочных скриптов?",
    "answersTrue": [
      "перехват и обработка динамических значений сетевого траффика"
    ],
    "answersFalse": [
      "перехват и обработка значений траффика, неизменных при многократном воспроизведении операции",
      "только перехват значений траффика",
      "замена значений в траффике на произвольные, генерируемые случайным образом при работе скрипта"
    ]
  },
  {
    "author": "Тимофеев Николай Петрович (ОНТИБиУР) 28/06/2016",
    "theme": "Общие вопросы по НТ",
    "question": "При равномерно подаваемой нагрузке тест длился 4-е часа при участии 2000 пользователей, в среднем продолжительность итерации составляла 10 минут. Сколько транзакций выполнялось в течении 1 минуты в среднем, если учесть, что транзакция включает в себя все пользовательские операции в течение итерации...",
    "answersTrue": [
      "200"
    ],
    "answersFalse": [
      "150",
      "400",
      "475"
    ]
  },
  {
    "author": "Тимофеев Николай Петрович (ОНТИБиУР) 28/06/2016",
    "theme": "Общие вопросы по НТ",
    "question": "Какой код HTTP запроса указывает на то, что под нагрузкой в определенном бизнес-процессе или в веб-приложении в целом произошел сбой...",
    "answersTrue": [
      "500"
    ],
    "answersFalse": [
      "200",
      "403",
      "401"
    ]
  },
  {
    "author": "Бедрединов Дамир Самиуллович (ОНТИБиУР) 27/06/2016",
    "theme": "Вопросы по HP LR\\HP PC",
    "question": "Какая функция в LR Analysis позволяет сравнить метрику на графике с другими метриками за определенный интервал теста и вывести похожие тренды?",
    "answersTrue": [
      "Auto Correlate"
    ],
    "answersFalse": [
      "Apply Filter",
      "Drill Down",
      "Merge Graphs"
    ]
  },
  {
    "author": "Бедрединов Дамир Самиуллович (ОНТИБиУР) 27/06/2016",
    "theme": "Вопросы по HP LR\\HP PC",
    "question": "Какая функция в LR Analysis позволяет увидеть результат двух разных графиков одного теста на одном графике?",
    "answersTrue": [
      "Merge Graphs"
    ],
    "answersFalse": [
      "Apply Filter",
      "Auto Correlate",
      "Drill Down"
    ]
  },
  {
    "author": "Бедрединов Дамир Самиуллович (ОНТИБиУР) 27/06/2016",
    "theme": "Вопросы по HP LR\\HP PC",
    "question": "Какой компонент LoadRunner поддерживает UNIX?",
    "answersTrue": [
      "LoadGenerator"
    ],
    "answersFalse": [
      "Analysis",
      "Controller",
      "VuGen"
    ]
  },
  {
    "author": "Бедрединов Дамир Самиуллович (ОНТИБиУР) 27/06/2016",
    "theme": "Вопросы по HP LR\\HP PC",
    "question": "Где в Runtime-settings можно установить количество итераций?",
    "answersTrue": [
      "General: Run Logic"
    ],
    "answersFalse": [
      "General: Miscellaneous",
      "Browser: Browser Emulation",
      "Internet Protocol: Preferences"
    ]
  },
  {
    "author": "Бедрединов Дамир Самиуллович (ОНТИБиУР) 27/06/2016",
    "theme": "Вопросы по HP LR\\HP PC",
    "question": "Основная функция timeslots в Performance Center?",
    "answersTrue": [
      "Резервирование хостов PC"
    ],
    "answersFalse": [
      "Отображение графика запуска тестов",
      "Подключение к NTP серверам для получения текушего времени",
      "Подсчет оставшегося времени до конца всех тестов"
    ]
  },
  {
    "author": "Клишин Дмитрий Иванович (ОНТСАБП) 28/06/2016",
    "theme": "Общие вопросы по НТ",
    "question": "Выражение «Транзакция выполнялась 5 сек. по 90 перцентилю» означает?",
    "answersTrue": [
      "Отсортировали всю совокупность, отбросили 10% максимальных значений, взяли наибольшее значение из оставшихся"
    ],
    "answersFalse": [
      "90% транзакций выполнялись 5 сек",
      "Отсортировали всю совокупность, отбросили 10% минимальных значений, взяли наименьшее значение из оставшихся",
      "Отсортировали всю совокупность, отбросили 10% минимальных значений, взяли наибольшее значение из оставшихся"
    ]
  },
  {
    "author": "Клишин Дмитрий Иванович (ОНТСАБП) 28/06/2016",
    "theme": "Вопросы по HP LR\\HP PC",
    "question": "Для чего нужна функция lr.user_data_point(“user_name”, 5)?",
    "answersTrue": [
      "Функция записывает точку с координатами (time, 5) графика “user_name” для analysis"
    ],
    "answersFalse": [
      "Нет такой функции",
      "Функция определяет переменную “user_name” и присваивает ей значение 5",
      "Функция авторизации пользователя “user_name” с паролем 5"
    ]
  },
  {
    "author": "Клишин Дмитрий Иванович (ОНТСАБП) 28/06/2016",
    "theme": "ВНД 2297",
    "question": "Характеристика системы определяющая возможность системы обрабатывать определенное количество операций в АС за период времени это",
    "answersTrue": [
      "Производительность"
    ],
    "answersFalse": [
      "Уровень нагрузки",
      "Профиль нагрузки",
      "Пиковая производительность"
    ]
  },
  {
    "author": "Скоробогатов Андрей Владимирович (ОНТФСиЭКО) 28/06/2016",
    "theme": "Вопросы по HP LR\\HP PC",
    "question": "Вы разработали скрипт в HP Vuser Gеnerator, настроили его параметры выполнения в Runtime Settings. Далее добавили скрипт в сценарий HP Load Controller. И изменили параметры выполнения Runtime Settings сценария. После ваш коллега открыл скрипт, но не увидел изменений в Runtime Settings скрипта. Почему?",
    "answersTrue": [
      "Параметры Runtime Settings сценария и скрипта это разные настройки и данные значения прогружаются в сценарий только при добавлении скрипта в него"
    ],
    "answersFalse": [
      "Забыли нажать кнопку сохранить в сценарии",
      "Параметры Runtime Settings сценария и скрипта это разные настройки и данные значения прогружаются только при добавлении скрипта в сценарий и настройке синхронизации параметров со стороны HP Load Controller",
      "Не настроили автоматический импорт-экспорт параметров Runtime Settings сценария и скрипт"
    ]
  },
  {
    "author": "Скоробогатов Андрей Владимирович (ОНТФСиЭКО) 28/06/2016",
    "theme": "Общие вопросы по НТ",
    "question": "Почему в НТ используется 90%% (персентиль) для расчета времен откликов, а не другие статистические функции (например среднее)?",
    "answersTrue": [
      "Персентиль позволяет на большом временном ряду выявить отклонения от нормы, которые могут исказить результат"
    ],
    "answersFalse": [
      "Его легче считать, машина на которой обрабатываются данные теста использует меньше ресурсов",
      "Персентиль это тоже среднее, но после расчета среднее умножается на 0.9, чтобы отсеять значения, искажающие результат",
      "Персентиль это тоже самое, что и среднее, просто разные названия одного и того же термина"
    ]
  },
  {
    "author": "Кудрявцев Виталий Владимирович (ОНТСАБП) 28/06/2016",
    "theme": "Общие вопросы по НТ",
    "question": "Что необходимо сделать команде НТ в случае, когда в процессе НТ обнаружено, что указанный в методике профиль тестирования не содержит одной бизнес-операции (интенсивность – «средняя» по профилю)?",
    "answersTrue": [
      "Уточнить у аналитика АС\\бизнеса необходимость и важность включения данной бизнес операции в текущую итерацию нагрузочного тестирования"
    ],
    "answersFalse": [
      "Проводить НТ строго по методике, новую операцию не включать в профиль, никого не уведомлять",
      "Проводить НТ строго по методике, новую операцию не включать в профиль. Уведомить всех, согласовавших методику, что в ходе НТ выявлена операция, которая не входит в профиль",
      "Определить самим необходимость включения данной операции в профиль. Если решение положительное – скорректировать профиль. Уведомлять кого-либо об этих изменениях, скорректировать текущую методику – по желанию",
      "Определить самим необходимость включения данной операции в профиль. Если решение положительное – скорректировать профиль. Отправить МНТ на повторное согласование с сообщением, что актуализирован профиль НТ"
    ]
  },
  {
    "author": "Кудрявцев Виталий Владимирович (ОНТСАБП) 28/06/2016",
    "theme": "ВНД 2297",
    "question": "Вы отправили методику нагрузочного тестирования на финальное согласование, от системного и бизнес аналитика получено замечание, что они отказываются согласовывать документ, т.к. не обязаны это делать. Профиль создавался именно по информации от этих аналитиков. Как наиболее правильно поступить в данной ситуации?",
    "answersTrue": [
      "Аналитики не обязаны согласовывать весь документ, необходимо попросить их согласовать методику только в части профиля нагрузки"
    ],
    "answersFalse": [
      "Сообщить аналитикам, что они являются обязательными участниками согласования данного документа и они обязаны его согласовать",
      "Попросить разработчика согласовать профиль нагрузочного тестирования вместо аналитиков",
      "Не продолжать попытки дальше согласовать методику в части профиля, согласования других участников будет достаточно"
    ]
  },
  {
    "author": "Кудрявцев Виталий Владимирович (ОНТСАБП) 28/06/2016",
    "theme": "Вопросы по HP LR\\HP PC",
    "question": "У вас сейчас идёт тест, запущенный через HP PC. Вы знаете, что данный тест закончится строго через 2 часа и вы хотите запустить повторный полностью идентичный тест через 2 часа после остановки текущего. Генераторы в обоих тестах используются одни и те же. Как корректно настроить автоматический запуск второго теста?",
    "answersTrue": [
      "Запустить через “Resources” – “Timeslots” – “New” (автоматический запуск)"
    ],
    "answersFalse": [
      "В настройках сценария «Options» указать Delay в 4 часа, нажать «Run» (автоматический запуск)",
      "В данном случае возможен только ручной запуск",
      "Все указанные варианты обеспечат требуемый результат"
    ]
  },
  {
    "author": "Скоробогатов Андрей Владимирович (ОНТФСиЭКО) 28/06/2016",
    "theme": "ВНД 2297",
    "question": "Проводится тест поиска оптимального КТС. Каковы его критерии успешности?",
    "answersTrue": [
      "Подтверждение тестами на определение максимальной производительности обеспечения требуемой производительности на выбранном КТС",
      "Подтверждение надежности функционирования системы на выбранном КТС"
    ],
    "answersFalse": [
      "Утилизация CPU серверов не превысила 90%",
      "% кол-ва успешных транзакций более 95% от общего кол-ва транзакций"
    ]
  },
  {
    "author": "Скоробогатов Андрей Владимирович (ОНТФСиЭКО) 28/06/2016",
    "theme": "ВНД 2297",
    "question": "Кто является ответственным за расчет метрик НТ (кол-во документов в час, кол-во входов в день, кол-во клиентов в системе за последние 5 минут и тд.)?",
    "answersTrue": [
      "Менеджер по НТ"
    ],
    "answersFalse": [
      "Администраторы промышленной среды АС",
      "Инженер-тестировщик НТ",
      "Бизнес-заказчик задачи проведения НТ"
    ]
  },
  {
    "author": "Загородний Александр Владимирович (ОНТСАБП) 28/06/2016",
    "theme": "Общие вопросы по НТ",
    "question": "Наиболее распространенными тестовыми артефактами являются:",
    "answersTrue": [
      "План тестирования (Test Plan)",
      "Набор тест кейсов и тестов (Test Case и Test suite)",
      "Дефекты / Баг Репорты (Bug Reports / Defects)"
    ],
    "answersFalse": [
      "Палантиры (Palantírs)"
    ]
  },
  {
    "author": "Загородний Александр Владимирович (ОНТСАБП) 28/06/2016",
    "theme": "ВНД 2297",
    "question": "Что не входит в перечень рекомендуемых целей нагрузочного тестирования?",
    "answersTrue": [
      "юзабилити-тестирование (проверка эргономичности)"
    ],
    "answersFalse": [
      "определение максимальной производительности",
      "проверка отказоустойчисвости",
      "выявление узких мест",
      "проверка надежности",
      "проверка исправления ошибки"
    ]
  },
  {
    "author": "Загородний Александр Владимирович (ОНТСАБП) 28/06/2016",
    "theme": "Вопросы по HP LR\\HP PC",
    "question": "Что не входит в список пользовательских интерфейсов, к которым предоставляет доступ ALM Client (клиентское приложение на АРМ пользователя)?",
    "answersTrue": [
      "Subversion (SVN) – централизованная система управления версиями"
    ],
    "answersFalse": [
      "Site Administration (администрирование) – Сайт Администратора предоставляет общее управление ресурсами и техническое управление системой",
      "Lab Management - управление лабораториями с клиентских компьютеров",
      "User Site – Пользовательский сайт - интерфейс для планирования, создания, просмотра и запуска нагрузочных тестов"
    ]
  },
  {
    "author": "Михалев Денис Игоревич (ОНТСАБП) 28/06/2016",
    "theme": "ВНД 2297",
    "question": "Укажите один или несколько обязательных данных для актуализации профиля нагрузки при проведении \"регрессионного нагрузочного тестирования\"",
    "answersTrue": [
      "Текущая статистика по операциям АС с пром. среды"
    ],
    "answersFalse": [
      "Текущий объем БД в пром. среде",
      "Планируемый объем БД через пол года в пром. среде",
      "Прогноз бизнес плана по приросту пользователей в следующем релизе в пром. среде"
    ]
  },
  {
    "author": "Михалев Денис Игоревич (ОНТСАБП) 28/06/2016",
    "theme": "ВНД 2297",
    "question": "Назовите самый ранний этап в жизненном цикле НТ, при котором необходимо выполнить такие действия как \"Анализ статистики по используемым операциям АС\", \"Запрос бизнес сценариев использования АС\" (запрос пользовательских операций для АС)",
    "answersTrue": [
      "Этап подготовки методики нагрузочного тестирования"
    ],
    "answersFalse": [
      "Этап создания автоматизированных нагрузочных скриптов",
      "Этап актуализации сценариев нагрузочного тестирования",
      "Этап предпроектного обследования АС"
    ]
  },
  {
    "author": "Михалев Денис Игоревич (ОНТСАБП) 28/06/2016",
    "theme": "Общие вопросы по НТ",
    "question": "Что необходимо сделать перед проведением нагрузочного теста, планируемые результаты которого пойдут в отчет НТ",
    "answersTrue": [
      "Выключить сервисы смежных АС, которые не принимают участие в тестировании, чтобы получить \"эталонные\" тестовые результаты",
      "Включить более подробный уровень логирования на тестовом нагрузочном контроллере и станциях подачи нагрузки для нагрузочного ПО, чтобы были логи для более подробного анализа ошибок, полученных в ходе проведения тестировани"
    ],
    "answersFalse": [
      "Выключить средства мониторинга на тестовых серверах, чтобы получить \"эталонные\" тестовые результаты",
      "Включить более подробный уровень логирования на тестируемых серверах АС, для того чтобы при возникновении дефектов производительности можно было после анализа подробных логов с полной уверенностью включить полученные дефекты в отчет НТ и, соответственно, приложить эти логи как доказательство",
      "Выключить более подробный уровень логирования на тестовом нагрузочном контроллере и станциях подачи нагрузки для нагрузочного ПО, чтобы логирование не помешало получить \"эталонные\" времена отклика по тестируемым операциям"
    ]
  },
  {
    "author": "Михалев Денис Игоревич (ОНТСАБП) 28/06/2016",
    "theme": "Вопросы по HP LR\\HP PC",
    "question": "В какой области http ответа на пользовательский запрос работает метод web_reg_save_param, используемый для корреляции параметров",
    "answersTrue": [
      "Response Headers",
      "Response Body"
    ],
    "answersFalse": [
      "Request Headers",
      "Request Body",
      "Все перечисленные варианты"
    ]
  },
  {
    "author": "Сторчак Елена Сергеевна (ОНТФСиЭКО) 28/06/2016",
    "theme": "ВНД 2297",
    "question": "Что такое профиль нагрузки?",
    "answersTrue": [
      "Набор операций совместно с данными об их интенсивностями"
    ],
    "answersFalse": [
      "Набор операций совместно с количеством виртуальных пользователей, их выполняющих",
      "Набор различных состояний загруженности системы, определенный на основе статистики с промышленной среды (например, утро, ночь, конец месяца и т.д.)",
      "Набор требований к производительности системы: количество пользователей, времена отклика, пиковая интенсивность в час и т.д."
    ]
  },
  {
    "author": "Сторчак Елена Сергеевна (ОНТФСиЭКО) 28/06/2016",
    "theme": "Общие вопросы по НТ",
    "question": "При проведении тестирования релиза в профиль нагрузки была включена новая операция, ее интенсивность профиле была определена на основе бизнес-прогноза. Как принимается решение о включении ее в профиль нагрузки при тестировании следующего релиза? Укажите все правильные утверждения",
    "answersTrue": [
      "Если в новой статистике с промышленной среды операция не попадает в топ 98% по интенсивности, ее все равно надо включить в профиль нагрузки, чтобы учесть отложенный спрос",
      "Если в новой статистике с промышленной среды операция не попадает в топ 98% по интенсивности, но результаты предыдущего НТ показали, что операция является \"тяжелой\", то операция должна быть включена в новый профиль"
    ],
    "answersFalse": [
      "Если в новой статистике с промышленной среды операция не попадает в топ 98% по интенсивности, то в новый профиль НТ ее можно не включать",
      "Для включения операции в профиль достаточно экспертной оценки разработчика"
    ]
  },
  {
    "author": "Кожухов Илья Алексеевич (ОНТСАБП) 28/06/2016",
    "theme": "ВНД 2297",
    "question": "Что является критериями успешного прохождения теста надежности?",
    "answersTrue": [
      "Восстановление доступности системы в течение требуемого времени",
      "Отсутствие утечки ресурсов в течение теста"
    ],
    "answersFalse": [
      "Отсутствие деградации производительности системы в ходе теста",
      "Определен уровень максимальной производительности системы"
    ]
  },
  {
    "author": "Кожухов Илья Алексеевич (ОНТСАБП) 28/06/2016",
    "theme": "Общие вопросы по НТ",
    "question": "Что является однозначным критерием успешного выполнения скрипта нагрузочного тестирования?",
    "answersTrue": [
      "Успешно пройдена проверка выполнения скрипта"
    ],
    "answersFalse": [
      "Получен 200 http код ответа по всем запросам",
      "Все запросы успешно отправлены на сервер",
      "Все http запросы в скрипте идентичны запросам, сделанным при записи скрипта через браузер"
    ]
  },
  {
    "author": "Патоля Лев Сергеевич (ОНТАБС) 29/06/2016",
    "theme": "ВНД 2297",
    "question": "Каковы типичные цели проведения НТ при необходимости замены старого КТС?",
    "answersTrue": [
      "Определение Lmax и подбор оптимального КТС"
    ],
    "answersFalse": [
      "Определение Lmax и выявление узких мест",
      "Определение Lmax, подбор оптимального КТС и проверка отказоустойчивости",
      "Воспроизведение проблем промышленной среды и проверка исправления ошибки"
    ]
  },
  {
    "author": "Патоля Лев Сергеевич (ОНТАБС) 29/06/2016",
    "theme": "ВНД 2297",
    "question": "Каковы типичные цели проведения НТ при возникновении инцидента/проблемы?",
    "answersTrue": [
      "Воспроизведение проблем промышленной среды и проверка исправления ошибки"
    ],
    "answersFalse": [
      "Определение Lmax, воспроизведение проблем промышленной среды и проверка исправления ошибки",
      "Проверка исправления ошибки",
      "Воспроизведение проблем промышленной среды"
    ]
  },
  {
    "author": "Патоля Лев Сергеевич (ОНТАБС) 29/06/2016",
    "theme": "ВНД 2297",
    "question": "За разработку каких документов отвечает тестировщик (инженер)?",
    "answersTrue": [
      "СНТ(исходный код), Результаты тестирования, Отчет о тестировании, Заключение о тестировании"
    ],
    "answersFalse": [
      "ТЗ НТ, спецификация НТ, Методика НТ, СНТ(исходный код), Результаты тестирования",
      "Методика НТ, СНТ(исходный код), Результаты тестирования, Заключение о тестировании",
      "Спецификация НТ, СНТ(исходный код), Результаты тестирования, Отчет о тестировании, Заключение о тестировании"
    ]
  },
  {
    "author": "Патоля Лев Сергеевич (ОНТАБС) 29/06/2016",
    "theme": "ВНД 2297",
    "question": "Кто не участвует в согласовании отчета и заключения о тестировании?",
    "answersTrue": [
      "Системный аналитик, тестировщик (аналитик), тестировщик(инженер)"
    ],
    "answersFalse": [
      "Менеджер по НТ, Тестировщик(менеджер)",
      "Администратор ГВС, администратор ЛВС",
      "Разработчик АС, Администратор АС"
    ]
  },
  {
    "author": "Патоля Лев Сергеевич (ОНТАБС) 29/06/2016",
    "theme": "ВНД 2297",
    "question": "Что является наивысшей интенсивностью выполнения операций, обслуживаемых системой, возможно, с нарушением требуемого качества обслуживания (длительности обработки операций, уровень сбойных операций)?",
    "answersTrue": [
      "Пиковая производительность"
    ],
    "answersFalse": [
      "Максимальная производительность",
      "Типичная производительность",
      "Стахановская производительность"
    ]
  },
  {
    "author": "Патоля Лев Сергеевич (ОНТАБС) 29/06/2016",
    "theme": "ВНД 2297",
    "question": "Контрольный тест для определения Lmax (максимальной производительности) проводится при нагрузке…",
    "answersTrue": [
      "меньше L0"
    ],
    "answersFalse": [
      "равной L0 (предельной производительности)",
      "больше L0",
      "произвольной от L0"
    ]
  },
  {
    "author": "Патоля Лев Сергеевич (ОНТАБС) 29/06/2016",
    "theme": "ВНД 2297",
    "question": "Тест надежности выполняется на уровне типичной нагрузки, который обычно устанавливается на уровне … от максимальной (Lmax)",
    "answersTrue": [
      "70%"
    ],
    "answersFalse": [
      "равной максимальной Lmax",
      "50%",
      "60%"
    ]
  },
  {
    "author": "https://fincult.info/",
    "theme": "Финансовая культура",
    "question": "Какой банкноты не существует?",
    "answersTrue": [
      "300 рублей"
    ],
    "answersFalse": [
      "5 рублей",
      "10 рублей",
      "1000 рублей",
      "5000 рублей"
    ]
  },
  {
    "author": "https://fincult.info/",
    "theme": "Финансовая культура",
    "question": "Как проверить подлинность банкноты?",
    "answersTrue": [
      "Проверить как минимум 3 защитных признака"
    ],
    "answersFalse": [
      "Это невозможно без специального оборудования",
      "Достаточно проверить один защитный признак",
      "Понюхать! Настоящие деньги не пахнут"
    ]
  },
  {
    "author": "https://fincult.info/",
    "theme": "Финансовая культура",
    "question": "Инфляция означает, что на одну и ту же сумму денег по прошествии некоторого времени можно будет купить…",
    "answersTrue": [
      "Меньше товаров и услуг"
    ],
    "answersFalse": [
      "Больше товаров и услуг",
      "Столько же товаров и услуг"
    ]
  },
  {
    "author": "https://fincult.info/",
    "theme": "Финансовая культура",
    "question": "Как называется устойчивое снижение цен?",
    "answersTrue": [
      "Дефляция"
    ],
    "answersFalse": [
      "Девальвация",
      "Деноминация",
      "Да так не бывает!"
    ]
  },
  {
    "author": "https://fincult.info/",
    "theme": "Финансовая культура",
    "question": "Что происходит с инфляционными ожиданиями при росте инфляции?",
    "answersTrue": [
      "Растут, ведь чем больше растут цены, тем больше мы их боимся"
    ],
    "answersFalse": [
      "Снижаются, ведь все очень надеются на то, что рост цен прекратится",
      "С ростом инфляции люди вообще стараются не думать о ценах"
    ]
  },
  {
    "author": "https://fincult.info/",
    "theme": "Финансовая культура",
    "question": "Каков режим валютного курса в России?",
    "answersTrue": [
      "Плавающий"
    ],
    "answersFalse": [
      "Фиксированный",
      "Гибкий"
    ]
  },
  {
    "author": "https://fincult.info/",
    "theme": "Финансовая культура",
    "question": "Как определяется официальный валютный курс?",
    "answersTrue": [
      "Курс постоянно колеблется в процессе торгов на валютной бирже, официальный курс – это среднее значение за определенный промежуток торгов в течение одного дня"
    ],
    "answersFalse": [
      "Центральный банк устанавливает официальный курс так, как считает необходимым",
      "Официальный валютный курс никто уже давно не устанавливает, все могут продавать и покупать валюту по любому курсу"
    ]
  }
]